; domain
(define (domain cell-assembly)
  (:requirements :strips :typing
		 :negative-preconditions
		 :action-costs)
  (:types arm
	  position
	  holdable
	  job - object
          reachable - position ; Where the arms are potentially able to go.
	  conveyor  - position ; Slide things in/away. Not reachable.
	  table - reachable    ; The place to attach components with arms.
	  tray - reachable     ; Part trays.
	  machine - table      ; Tables with specific feature (e.g. painting). Run jobs by itself.
	  machine-job - job    ; Jobs which should be done on machines.
	  base - holdable      ;
	  component - holdable ; Things which should be attatched on tables.
	  )
  (:constants carry-in - conveyor  ; the start of the base
	      carry-out - conveyor ; the goal of the base
	      table-in - table	   ; always connected to the conveyor
	      table-out - table	   ; always connected to the conveyor
	      nothing-done - job)  ; general start state of any base
  (:predicates 

   ;; arm attributes
   (reachable ?arm - arm ?to - reachable)
   ;; position attributes
   (connected ?from ?to - position)
   ;; job attributes
   (depends ?prev-job ?job - job)
   (job-available-at ?job - job ?pos - table)
   (uses ?job - job ?component - component)
   ;; state description
   (at ?obj - object ?pos - position)
   (arm-present ?pos - reachable)
   (base-present ?pos - position)
   (hold ?arm - arm ?holdable - holdable)
   (free ?arm - arm)
   (finished ?job - job ?base - base))
  (:functions
   (total-cost)
   (loading-cost)        ; the cost to set and eject base
   (job-cost ?job - job) ; the cost to do each job
   (move-cost ?from ?to - reachable) - number)
  (:action move-arm
           ;; Moves the arm (?arm) from the source (?from) to the destination
           ;; (?to). The not-arm-present propositions enforce a mutual exclusion
           ;; constraint so that only one arm can occupy any given location at a
           ;; time.
	   :parameters (?arm - arm ?from ?to - reachable)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (free ?arm)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  (:action move-arm-holding
           ;; Same as move-arm, but assumes the arm is holding something.
	   :parameters (?arm - arm
                        ?from ?to - reachable
                        ?thing - holdable)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (hold ?arm ?thing)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  (:action eject-base
           ;; Eject Base: Uses an arm (?arm) to grasp and pick up a base (?base)
           ;; from a machine or a table (?pos). Resets the mutual exclusion
           ;; constraint on the table (not-base-present ?pos).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (at ?base ?pos)
			      (at ?arm ?pos)
			      (free ?arm))
	   :effect (and (hold ?arm ?base)
			(not (free ?arm))
			(not (base-present ?pos))
			(not (at ?base ?pos))
			(increase (total-cost) (loading-cost))))
  (:action set-base
           ;; Set Base: Commands an arm (?arm) that is holding a
           ;; particular base (?base) to set the base on a machine or
           ;; table (?pos). Sets the mutual exclusion constraint
           ;; (not-base-present ?pos).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (hold ?arm ?base)
			      (at ?arm ?pos)
			      (not (base-present ?pos)))
	   :effect (and (at ?base ?pos)
			(free ?arm)
			(not (hold ?arm ?base))
			(base-present ?pos)
			(increase (total-cost) (loading-cost))))
  (:action slide-base-in
           ;; Slide Base: Uses a slide device to move a base.
           ;; CARRY-IN device only.
           ;; It cares if the destination is already used.
	   :parameters (?base - base ?from - conveyor ?to - table)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to)
			      (not (base-present ?to)))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(base-present ?to)
			(increase (total-cost) (loading-cost))))
  (:action slide-base-out
           ;; Slide Base: Uses a slide device to move a base. 
           ;; CARRY-OUT device only.
           ;; It doesn't care if the destination is already used.
           ;; After the action the base acts like it had disappeared.
	   :parameters (?base - base ?from - table ?to - conveyor)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(not (base-present ?from))
			(increase (total-cost) (loading-cost))))
  (:action pickup-component
           ;; Use an arm (?arm) to pick up a part (?part). The part will later be
           ;; used by assemble-with-arm.  NOTE: We assume there are unlimited
           ;; number of components in trays. That's why this action lacks the
           ;; delete effect on the place of the component (i.e. (not (at ?component
           ;; ?pos))).
	   :parameters (?component - component ?arm - arm ?pos - tray)
	   :precondition (and (free ?arm)
			      (at ?arm ?pos)
			      (at ?component ?pos))
	   :effect (and (hold ?arm ?component)
			(not (free ?arm))
			(increase (total-cost) (loading-cost))))
  (:action assemble-with-machine
           ;; Use a machine (?pos) to perform an assembly operation (e.g.,
           ;; tighten the screw, paint the base etc) on a base (?base).
           ;; The target base should fulfill some ordering constraints, e.g.
           ;; a base should be painted after a component X is attatched.

           ;; The ordering constraints are given in the problem.  This assumption
           ;; is realistic because when a product is designed, the designer always
           ;; considers how they are assembled.
	   :parameters (?base - base
                        ?machine - machine
                        ?job - machine-job
                        ?prev-job - job)
	   :precondition (and ;; machine specification
			  (job-available-at ?job ?machine)
			  ;; state specification
			  (not (finished ?job ?base))
			  (at ?base ?machine)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(increase (total-cost) (job-cost ?job))))
  (:action assemble-with-arm
           ;; Uses an arm (?arm) to attach a part (?component) to a base.  This
           ;; operation should be done on a table.
	   :parameters (?component - component
			?job ?prev-job - job
			?base - base
			?arm - arm
			?pos - table)
	   :precondition (and
			  ;; job specification
			  (job-available-at ?job ?pos)
			  (uses ?job ?component)
			  ;; state specification
			  (hold ?arm ?component)
			  (at ?arm ?pos)
			  (at ?base ?pos)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(free ?arm)
			(not (hold ?arm ?component))
			(increase (total-cost) (job-cost ?job)))))

; problem
(DEFINE (PROBLEM CELL-ASSEMBLY-MODEL2B-2) (:DOMAIN CELL-ASSEMBLY)
 (:OBJECTS ARM - ARM B-0 B-1 - BASE PART-A PART-B PART-C - COMPONENT TRAY-A
  TRAY-B TRAY-C - TRAY TABLE1 - TABLE SCREW-MACHINE-A SCREW-MACHINE-C - MACHINE
  ATTATCH-A - JOB SCREW-A - MACHINE-JOB ATTATCH-B - JOB ATTATCH-C - JOB SCREW-C
  - MACHINE-JOB)
 (:INIT (= (TOTAL-COST) 0) (= (LOADING-COST) 1) (REACHABLE ARM SCREW-MACHINE-C)
  (REACHABLE ARM SCREW-MACHINE-A) (REACHABLE ARM TABLE-IN)
  (REACHABLE ARM TABLE-OUT) (REACHABLE ARM TABLE1) (REACHABLE ARM TRAY-A)
  (REACHABLE ARM TRAY-B) (REACHABLE ARM TRAY-C)
  (= (MOVE-COST TABLE1 TABLE1) 1000) (= (MOVE-COST TABLE1 SCREW-MACHINE-A) 2)
  (= (MOVE-COST TABLE1 TRAY-A) 3) (= (MOVE-COST TABLE1 TRAY-B) 4)
  (= (MOVE-COST TABLE1 TRAY-C) 5) (= (MOVE-COST TABLE1 SCREW-MACHINE-C) 4)
  (= (MOVE-COST TABLE1 TABLE-OUT) 3) (= (MOVE-COST TABLE1 TABLE-IN) 2)
  (= (MOVE-COST SCREW-MACHINE-A TABLE1) 2)
  (= (MOVE-COST SCREW-MACHINE-A SCREW-MACHINE-A) 1000)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-A) 2)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-B) 3)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-C) 4)
  (= (MOVE-COST SCREW-MACHINE-A SCREW-MACHINE-C) 5)
  (= (MOVE-COST SCREW-MACHINE-A TABLE-OUT) 4)
  (= (MOVE-COST SCREW-MACHINE-A TABLE-IN) 3) (= (MOVE-COST TRAY-A TABLE1) 3)
  (= (MOVE-COST TRAY-A SCREW-MACHINE-A) 2) (= (MOVE-COST TRAY-A TRAY-A) 1000)
  (= (MOVE-COST TRAY-A TRAY-B) 2) (= (MOVE-COST TRAY-A TRAY-C) 3)
  (= (MOVE-COST TRAY-A SCREW-MACHINE-C) 4) (= (MOVE-COST TRAY-A TABLE-OUT) 5)
  (= (MOVE-COST TRAY-A TABLE-IN) 4) (= (MOVE-COST TRAY-B TABLE1) 4)
  (= (MOVE-COST TRAY-B SCREW-MACHINE-A) 3) (= (MOVE-COST TRAY-B TRAY-A) 2)
  (= (MOVE-COST TRAY-B TRAY-B) 1000) (= (MOVE-COST TRAY-B TRAY-C) 2)
  (= (MOVE-COST TRAY-B SCREW-MACHINE-C) 3) (= (MOVE-COST TRAY-B TABLE-OUT) 4)
  (= (MOVE-COST TRAY-B TABLE-IN) 5) (= (MOVE-COST TRAY-C TABLE1) 5)
  (= (MOVE-COST TRAY-C SCREW-MACHINE-A) 4) (= (MOVE-COST TRAY-C TRAY-A) 3)
  (= (MOVE-COST TRAY-C TRAY-B) 2) (= (MOVE-COST TRAY-C TRAY-C) 1000)
  (= (MOVE-COST TRAY-C SCREW-MACHINE-C) 2) (= (MOVE-COST TRAY-C TABLE-OUT) 3)
  (= (MOVE-COST TRAY-C TABLE-IN) 4) (= (MOVE-COST SCREW-MACHINE-C TABLE1) 4)
  (= (MOVE-COST SCREW-MACHINE-C SCREW-MACHINE-A) 5)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-A) 4)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-B) 3)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-C) 2)
  (= (MOVE-COST SCREW-MACHINE-C SCREW-MACHINE-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C TABLE-OUT) 2)
  (= (MOVE-COST SCREW-MACHINE-C TABLE-IN) 3) (= (MOVE-COST TABLE-OUT TABLE1) 3)
  (= (MOVE-COST TABLE-OUT SCREW-MACHINE-A) 4)
  (= (MOVE-COST TABLE-OUT TRAY-A) 5) (= (MOVE-COST TABLE-OUT TRAY-B) 4)
  (= (MOVE-COST TABLE-OUT TRAY-C) 3)
  (= (MOVE-COST TABLE-OUT SCREW-MACHINE-C) 2)
  (= (MOVE-COST TABLE-OUT TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT TABLE-IN) 2)
  (= (MOVE-COST TABLE-IN TABLE1) 2) (= (MOVE-COST TABLE-IN SCREW-MACHINE-A) 3)
  (= (MOVE-COST TABLE-IN TRAY-A) 4) (= (MOVE-COST TABLE-IN TRAY-B) 5)
  (= (MOVE-COST TABLE-IN TRAY-C) 4) (= (MOVE-COST TABLE-IN SCREW-MACHINE-C) 3)
  (= (MOVE-COST TABLE-IN TABLE-OUT) 2) (= (MOVE-COST TABLE-IN TABLE-IN) 1000)
  (CONNECTED CARRY-IN TABLE-IN) (CONNECTED TABLE-OUT CARRY-OUT)
  (= (JOB-COST SCREW-C) 2) (DEPENDS ATTATCH-C SCREW-C)
  (JOB-AVAILABLE-AT SCREW-C SCREW-MACHINE-C) (AT PART-C TRAY-C)
  (USES ATTATCH-C PART-C) (= (JOB-COST ATTATCH-C) 2)
  (DEPENDS ATTATCH-B ATTATCH-C) (JOB-AVAILABLE-AT ATTATCH-C TABLE1)
  (AT PART-B TRAY-B) (USES ATTATCH-B PART-B) (= (JOB-COST ATTATCH-B) 2)
  (DEPENDS SCREW-A ATTATCH-B) (JOB-AVAILABLE-AT ATTATCH-B TABLE1)
  (= (JOB-COST SCREW-A) 3) (DEPENDS ATTATCH-A SCREW-A)
  (JOB-AVAILABLE-AT SCREW-A SCREW-MACHINE-A) (AT PART-A TRAY-A)
  (USES ATTATCH-A PART-A) (= (JOB-COST ATTATCH-A) 2)
  (DEPENDS NOTHING-DONE ATTATCH-A) (JOB-AVAILABLE-AT ATTATCH-A TABLE-IN)
  (= (JOB-COST NOTHING-DONE) 0) (AT B-0 CARRY-IN) (FINISHED NOTHING-DONE B-0)
  (AT B-1 CARRY-IN) (FINISHED NOTHING-DONE B-1) (FREE ARM) (AT ARM TABLE-IN)
  (ARM-PRESENT TABLE-IN))
 (:GOAL
  (AND (AT B-0 CARRY-OUT) (FINISHED SCREW-C B-0) (AT B-1 CARRY-OUT)
       (FINISHED SCREW-C B-1)))
 (:METRIC MINIMIZE (TOTAL-COST)))

; plan
1. (slide-base-in b-1 carry-in table-in)
   deleted: (at b-1 carry-in)
   added: (at b-1 table-in) (base-present table-in)
   goals met: 0 of 4
2. (move-arm arm table-in tray-a)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 4
3. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a)
   goals met: 0 of 4
4. (move-arm-holding arm tray-a table-in part-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 4
5. (assemble-with-arm part-a attatch-a nothing-done b-1 arm table-in)
   deleted: (hold arm part-a)
   added: (finished attatch-a b-1) (free arm)
   goals met: 0 of 4
6. (eject-base b-1 arm table-in)
   deleted: (free arm) (base-present table-in) (at b-1 table-in)
   added: (hold arm b-1)
   goals met: 0 of 4
7. (slide-base-in b-0 carry-in table-in)
   deleted: (at b-0 carry-in)
   added: (at b-0 table-in) (base-present table-in)
   goals met: 0 of 4
8. (move-arm-holding arm table-in screw-machine-a b-1)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 4
9. (set-base b-1 arm screw-machine-a)
   deleted: (hold arm b-1)
   added: (at b-1 screw-machine-a) (free arm) (base-present screw-machine-a)
   goals met: 0 of 4
10. (assemble-with-machine b-1 screw-machine-a screw-a attatch-a)
   added: (finished screw-a b-1)
   goals met: 0 of 4
11. (eject-base b-1 arm screw-machine-a)
   deleted: (free arm) (base-present screw-machine-a) (at b-1 screw-machine-a)
   added: (hold arm b-1)
   goals met: 0 of 4
12. (move-arm-holding arm screw-machine-a table1 b-1)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 4
13. (set-base b-1 arm table1)
   deleted: (hold arm b-1)
   added: (at b-1 table1) (free arm) (base-present table1)
   goals met: 0 of 4
14. (move-arm arm table1 tray-b)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 0 of 4
15. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b)
   goals met: 0 of 4
16. (move-arm-holding arm tray-b table1 part-b)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 4
17. (assemble-with-arm part-b attatch-b screw-a b-1 arm table1)
   deleted: (hold arm part-b)
   added: (finished attatch-b b-1) (free arm)
   goals met: 0 of 4
18. (move-arm arm table1 tray-a)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 4
19. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a)
   goals met: 0 of 4
20. (move-arm-holding arm tray-a table-in part-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 4
21. (assemble-with-arm part-a attatch-a nothing-done b-0 arm table-in)
   deleted: (hold arm part-a)
   added: (finished attatch-a b-0) (free arm)
   goals met: 0 of 4
22. (move-arm arm table-in tray-c)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 0 of 4
23. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c)
   goals met: 0 of 4
24. (move-arm-holding arm tray-c table1 part-c)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 4
25. (assemble-with-arm part-c attatch-c attatch-b b-1 arm table1)
   deleted: (hold arm part-c)
   added: (finished attatch-c b-1) (free arm)
   goals met: 0 of 4
26. (eject-base b-1 arm table1)
   deleted: (free arm) (base-present table1) (at b-1 table1)
   added: (hold arm b-1)
   goals met: 0 of 4
27. (move-arm-holding arm table1 screw-machine-c b-1)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm screw-machine-c) (arm-present screw-machine-c)
   goals met: 0 of 4
28. (set-base b-1 arm screw-machine-c)
   deleted: (hold arm b-1)
   added: (at b-1 screw-machine-c) (free arm) (base-present screw-machine-c)
   goals met: 0 of 4
29. (assemble-with-machine b-1 screw-machine-c screw-c attatch-c)
   added: (finished screw-c b-1)
   goals met: 1 of 4
30. (eject-base b-1 arm screw-machine-c)
   deleted: (free arm) (base-present screw-machine-c) (at b-1 screw-machine-c)
   added: (hold arm b-1)
   goals met: 1 of 4
31. (move-arm-holding arm screw-machine-c table-out b-1)
   deleted: (at arm screw-machine-c) (arm-present screw-machine-c)
   added: (at arm table-out) (arm-present table-out)
   goals met: 1 of 4
32. (set-base b-1 arm table-out)
   deleted: (hold arm b-1)
   added: (at b-1 table-out) (free arm) (base-present table-out)
   goals met: 1 of 4
33. (slide-base-out b-1 table-out carry-out)
   deleted: (at b-1 table-out) (base-present table-out)
   added: (at b-1 carry-out)
   goals met: 2 of 4
34. (move-arm arm table-out table-in)
   deleted: (at arm table-out) (arm-present table-out)
   added: (at arm table-in) (arm-present table-in)
   goals met: 2 of 4
35. (eject-base b-0 arm table-in)
   deleted: (free arm) (base-present table-in) (at b-0 table-in)
   added: (hold arm b-0)
   goals met: 2 of 4
36. (move-arm-holding arm table-in screw-machine-a b-0)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 2 of 4
37. (set-base b-0 arm screw-machine-a)
   deleted: (hold arm b-0)
   added: (at b-0 screw-machine-a) (free arm) (base-present screw-machine-a)
   goals met: 2 of 4
38. (assemble-with-machine b-0 screw-machine-a screw-a attatch-a)
   added: (finished screw-a b-0)
   goals met: 2 of 4
39. (eject-base b-0 arm screw-machine-a)
   deleted: (free arm) (base-present screw-machine-a) (at b-0 screw-machine-a)
   added: (hold arm b-0)
   goals met: 2 of 4
40. (move-arm-holding arm screw-machine-a table1 b-0)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm table1) (arm-present table1)
   goals met: 2 of 4
41. (set-base b-0 arm table1)
   deleted: (hold arm b-0)
   added: (at b-0 table1) (free arm) (base-present table1)
   goals met: 2 of 4
42. (move-arm arm table1 tray-b)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 2 of 4
43. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b)
   goals met: 2 of 4
44. (move-arm-holding arm tray-b table1 part-b)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table1) (arm-present table1)
   goals met: 2 of 4
45. (assemble-with-arm part-b attatch-b screw-a b-0 arm table1)
   deleted: (hold arm part-b)
   added: (finished attatch-b b-0) (free arm)
   goals met: 2 of 4
46. (move-arm arm table1 tray-c)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 2 of 4
47. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c)
   goals met: 2 of 4
48. (move-arm-holding arm tray-c table1 part-c)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm table1) (arm-present table1)
   goals met: 2 of 4
49. (assemble-with-arm part-c attatch-c attatch-b b-0 arm table1)
   deleted: (hold arm part-c)
   added: (finished attatch-c b-0) (free arm)
   goals met: 2 of 4
50. (eject-base b-0 arm table1)
   deleted: (free arm) (base-present table1) (at b-0 table1)
   added: (hold arm b-0)
   goals met: 2 of 4
51. (move-arm-holding arm table1 screw-machine-c b-0)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm screw-machine-c) (arm-present screw-machine-c)
   goals met: 2 of 4
52. (set-base b-0 arm screw-machine-c)
   deleted: (hold arm b-0)
   added: (at b-0 screw-machine-c) (free arm) (base-present screw-machine-c)
   goals met: 2 of 4
53. (assemble-with-machine b-0 screw-machine-c screw-c attatch-c)
   added: (finished screw-c b-0)
   goals met: 3 of 4
54. (eject-base b-0 arm screw-machine-c)
   deleted: (free arm) (base-present screw-machine-c) (at b-0 screw-machine-c)
   added: (hold arm b-0)
   goals met: 3 of 4
55. (move-arm-holding arm screw-machine-c table-out b-0)
   deleted: (at arm screw-machine-c) (arm-present screw-machine-c)
   added: (at arm table-out) (arm-present table-out)
   goals met: 3 of 4
56. (set-base b-0 arm table-out)
   deleted: (hold arm b-0)
   added: (at b-0 table-out) (free arm) (base-present table-out)
   goals met: 3 of 4
57. (slide-base-out b-0 table-out carry-out)
   deleted: (at b-0 table-out) (base-present table-out)
   added: (at b-0 carry-out)
   goals met: 4 of 4
